capture program drop chgdiv6_chat
program define chgdiv6_chat
	version 14
	syntax [anything(name=divine)]
	local quif=0
	if missing("`divine'") {
    }
	 else {
        capture confirm number `divine'
        if _rc == 0 {
			local divine=mod(`divine',2147483647)
        }
        else {
		    local question "`divine'"
			local quif=1
			local maxx=ustrlen("`divine'")
			local number=0
			local numtem=0
			forvalues ixx = 1/`maxx' {
				local sglstr=usubstr("`divine'",`ixx',1)
				local sglstr = tobytes("`sglstr'")
				local max = length("`sglstr'")
				forvalues ix = 1/`max' {
					local char = substr("`sglstr'",`ix', 1)
					if regexm("`char'", "[0-9]") {
						local numtem "`numtem'`char'"
					}
				}
				local number=`number'+`numtem'
				local numtem=0
			}
			if `number'>10^14{
			    di as error "请您把话说得更简练一些."
				exit
			}
			local divine = mod(`number',2147483647)
        }
		set seed `divine'
    }
	qui di c(current_date)
	qui di c(current_time)
	di in white "日期：今天是" c(current_date) "，现在是" c(current_time)
	di in white " 假尔泰筮有常,"_n" 今以事，未知可否。"_n" 爰质所疑于神之灵,"_n" 吉凶得失、悔吝忧虞,"_n" 唯尔有神，尚明告之。"
	di in yellow "起卦————"
	local tosstime =6
	local chgsum =0
	matrix define divinatory = J(6, 2, .)
	matrix rownames divinatory = "上爻(天)" "五爻(天)" "四爻(人)" "三爻(人)" "二爻(地)" "初爻(地)"
	matrix colnames divinatory = "本卦" "变卦"
	while `tosstime'>0{
		local coin1 = int(runiform() + 0.5)
		local coin2 = int(runiform() + 0.5)
		local coin3 = int(runiform() + 0.5)
		local coinsum =`coin1' + `coin2' +`coin3'
		 //抛硬币
		if `coinsum'==3 {
			mat divinatory[`tosstime',1] =1
			mat divinatory[`tosstime',2] =0
			local chgsum =`chgsum'+1
		} //重
		else if `coinsum'==2 {
			mat divinatory[`tosstime',1] =0
			mat divinatory[`tosstime',2] =0
		} //拆
		else if `coinsum'==1 {
			mat divinatory[`tosstime',1] =1
			mat divinatory[`tosstime',2] =1
		} //单
		else if `coinsum'==0 {
			mat divinatory[`tosstime',1] =0
			mat divinatory[`tosstime',2] =1
			local chgsum =`chgsum'+1 
		} //交
		local tosstime =`tosstime'-1
	} //得到卦象
	foreach row in 1 2 3 4 5 6{
		local i=el(divinatory,`row',1)
		local div "`div'`i'"
	}
	foreach row in 1 2 3 4 5 6{
		local i=el(divinatory,`row',2)
		local chgdiv "`chgdiv'`i'"
	}
	
	 //接着输入64卦及各爻的卦辞和爻辞
	local div111111_0 "乾卦 卦辞:元，亨，利，贞。《象》曰：天行健，君子以自强不息。"
	local div111111_6 "乾卦 初九爻辞:潜龙勿用。《象》曰：潜龙勿用，阳在下也。"
	local div111111_5 "乾卦 九二爻辞:见龙在田，利见大人。《象》日：见龙在田，德施普也。"
	local div111111_4 "乾卦 九三爻辞:君子终日乾乾，夕惕若厉，无咎。《象》曰：终日乾乾，反复道也。"
	local div111111_3 "乾卦 九四爻辞:或跃在渊，无咎。《象》曰：或跃在渊，进无咎也。"
	local div111111_2 "乾卦 九五爻辞:飞龙在天，利见大人。《象》曰：飞龙在天，大人造也。"
	local div111111_1 "乾卦 上九爻辞:亢龙有悔。《象》日：亢龙有悔，盈不可久也。"
	local div000000_0 "坤卦 卦辞:元亨，利牝马之贞。君子有攸往，先迷后得主。利西南得朋，东北丧朋。安贞吉。《象》曰：地势坤，君子以厚德载物。"
	local div000000_6 "坤卦 初六爻辞:履霜，坚冰至。《象》曰：履霜坚冰，阴始凝也。驯致其道，至坚冰也。"
	local div000000_5 "坤卦 六二爻辞:直方大，不习，无不利。《象》曰：六二之动，直以方也。不习，无不利，地道光也。"
	local div000000_4 "坤卦 六三爻辞:含章可贞。或从王事，无成有终。《象》曰：含章可贞；以时发也。或从王事，知光大也。"
	local div000000_3 "坤卦 六四爻辞:括囊，无咎无誉。《象》曰：括囊无咎，慎不害也。"
	local div000000_2 "坤卦 六五爻辞:黄裳，元吉。《象》曰：黄裳元吉，文在中也。"
	local div000000_1 "坤卦 上六爻辞:龙战于野，其血玄黄。《象》曰：龙战于野，其道穷也。"
	local div010001_0 "屯卦 卦辞:元亨利贞。勿用有攸往，利建侯。《象》曰：云雷屯，君子以经纶。"
	local div010001_6 "屯卦 初九爻辞:磐桓，利居贞，利建侯。《象》曰：虽磐桓，志行正也。以贵下贱，大得民也。"
	local div010001_5 "屯卦 六二爻辞:屯如邅如，乘马班如。匪寇，婚媾，女子贞不字，十年乃字。《象》曰：六二之难，乘刚也。十年乃字，反常也。"
	local div010001_4 "屯卦 六三爻辞:既鹿无虞，惟入于林中。君子几，不如舍，往吝。《象》曰：既鹿无虞，以纵禽也。君子舍之，往吝，穷也。"
	local div010001_3 "屯卦 六四爻辞:乘马班如，求婚媾，往吉，无不利。《象》曰：求而往，明也。"
	local div010001_2 "屯卦 九五爻辞:屯其膏，小贞吉，大贞凶。《象》曰：屯其膏，施未光也。"
	local div010001_1 "屯卦 上六爻辞:乘马班如，泣血涟如。《象》曰：泣血涟如，何可长也。"
	local div100010_0 "蒙卦 卦辞:亨。匪我求童蒙，童蒙求我。初噬告，再三渎，渎则不告。利贞。《象》曰：山下出泉，蒙。君子以果行育德。"
	local div100010_6 "蒙卦 初六爻辞:发蒙，利用刑人，用说桎梏；以往吝。《象》曰：利用刑人，以正法也。"
	local div100010_5 "蒙卦 九二爻辞:包蒙，吉。纳妇，吉；子克家。《象》曰：子克家，刚柔接也。"
	local div100010_4 "蒙卦 六三爻辞:勿用娶女，见金夫，不有躬，无攸利。《象》曰：勿用娶女，行不顺也。"
	local div100010_3 "蒙卦 六四爻辞:困蒙，吝。《象》曰：困蒙之吝，独远实也。"
	local div100010_2 "蒙卦 六五爻辞:童蒙，吉。《象》曰：童蒙之吉，顺以巽也。"
	local div100010_1 "蒙卦 上九爻辞:击蒙，不利为寇，利御寇。《象》曰：利用御寇，上下顺也。"
	local div010111_0 "需卦 卦辞:有孚，光亨，贞吉。利涉大川。《象》曰：云上於天，需。君子以饮食宴乐。"
	local div010111_6 "需卦 初九爻辞:需于郊，利用恒，无咎。《象》曰：需于郊，不犯难行也。利用恒，无咎；未失常也。"
	local div010111_5 "需卦 九二爻辞:需于沙，小有言，终吉。《象》曰：需于沙，衍在中也。虽小有言，以终吉也。"
	local div010111_4 "需卦 九三爻辞:需于泥，致寇至。《象》曰：需于泥，灾在外也。自我致寇，敬慎不败也。"
	local div010111_3 "需卦 六四爻辞:需于血，出自穴。《象》曰：需于血，顺以听也。"
	local div010111_2 "需卦 九五爻辞:需于酒食，贞吉。《象》曰：酒食贞吉，以中正也。"
	local div010111_1 "需卦 上六爻辞:入于穴，有不速之客三人来，敬之终吉。《象》曰：不速之客来，敬之终吉。虽不当位，未大失也。"
	local div111010_0 "讼卦 卦辞:有孚，窒惕，中吉。终凶。利见大人，不利涉大川。《象》曰：天与水违行，讼。君子以作事谋始。"
	local div111010_6 "讼卦 初六爻辞:不永所事，小有言，终吉。《象》曰：不永所事，讼不可长也。虽有小言，其辩明也。"
	local div111010_5 "讼卦 九二爻辞:不克讼，归而逋，其邑人三百户无眚。《象》曰：不克讼，归逋窜也。自下讼上，患至掇也。"
	local div111010_4 "讼卦 六三爻辞:食旧德，贞厉，终吉。或从王事，无成。《象》曰：食旧德，从上吉也。"
	local div111010_3 "讼卦 九四爻辞:不克讼，复自命，渝安贞，吉。《象》曰：复即命，渝安贞；不失也。"
	local div111010_2 "讼卦 九五爻辞:讼，元吉。《象》曰：讼，元吉，以中正也。"
	local div111010_1 "讼卦 上九爻辞:或锡之鞶带，终朝三褫之。《象》曰：以讼受福，亦不足敬也。"
	local div000010_0 "师卦 卦辞:贞，丈人吉，无咎。《象》曰：地中有水，师，君子以容民蓄众。"
	local div000010_6 "师卦 初六爻辞:师出以律，否臧凶。《象》曰：师出以律，失律凶也。"
	local div000010_5 "师卦 九二爻辞:在师，中吉，无咎，王三锡命。《象》曰：在师中吉，承天宠也。王三锡命，怀万邦也。"
	local div000010_4 "师卦 六三爻辞:师或舆尸，凶。《象》曰：师或舆尸，大无功也。"
	local div000010_3 "师卦 六四爻辞:师左次，无咎。《象》曰：左次无咎，未失常也。"
	local div000010_2 "师卦 六五爻辞:田有禽，利执；言，无咎。长子帅师，弟子舆尸，贞凶。《象》曰：长子帅师，以中行也。弟子舆师，使不当也。"
	local div000010_1 "师卦 上六爻辞:大君有命，开国承家，小人勿用。《象》曰：大君有命，以正功也。小人勿用，必乱邦也。"
	local div010000_0 "比卦 卦辞:吉。原筮，元永贞，无咎。不宁方来，后夫凶。《象》曰：地上有水，比。先王以建万国，亲诸侯。"
	local div010000_6 "比卦 初六爻辞:有孚比之，无咎。有孚盈缶，终来有它吉。《象》曰：比之初六，有它吉也。"
	local div010000_5 "比卦 六二爻辞:比之自内，贞吉。《象》曰：比之自内，不自失也。"
	local div010000_4 "比卦 六三爻辞:比之匪人。《象》曰：比之匪人，不亦伤乎？"
	local div010000_3 "比卦 六四爻辞:外比之，贞吉。《象》曰：外比于贤，以从上也。"
	local div010000_2 "比卦 九五爻辞:显比，王用三驱，失前禽。邑人不诫，吉。《象》曰：显比之吉，位正中也。舍逆取顺，失前禽也。邑人不诫，上使中也。"
	local div010000_1 "比卦 上六爻辞:比之无首，凶。《象》曰：比之无首，无所终也。"
	local div110111_0 "小畜卦 卦辞:亨。密云不雨，自我西郊。《象》曰：风行天上，小畜。君子以懿文德。"
	local div110111_6 "小畜卦 初九爻辞:复自道，何其咎？吉。《象》曰：复自道，其义吉也。"
	local div110111_5 "小畜卦 九二爻辞:牵复，吉。《象》曰：牵复在中，亦不自失也。"
	local div110111_4 "小畜卦 九三爻辞:舆说辐，夫妻反目。《象》曰：夫妻反目，不能正室也。"
	local div110111_3 "小畜卦 六四爻辞:有孚，血去惕出，无咎。《象》曰：有孚惕出，上合志也。"
	local div110111_2 "小畜卦 九五爻辞:有孚挛如，富以其邻。《象》曰：有孚挛如，不独富也。"
	local div110111_1 "小畜卦 上九爻辞:既雨既处，尚德载。妇贞厉。月几望，君子征凶。《象》曰：既雨既处，德积载也。君子征凶，有所疑也。"
	local div111011_0 "履卦 卦辞:履虎尾，不咥人，亨。《象》曰：上天下泽，履。君子以辨上下，定民志。"
	local div111011_6 "履卦 初九爻辞:素履往，无咎。《象》曰：素履之往，独行愿也。"
	local div111011_5 "履卦 九二爻辞:履道坦坦，幽人贞吉。《象》曰：幽人贞吉，中不自乱也。"
	local div111011_4 "履卦 六三爻辞:眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。《象》曰：眇能视，不足以有明也。跛能履，不足以与行也。咥人之凶，位不当也。武人为于大君，志刚也。"
	local div111011_3 "履卦 九四爻辞:履虎尾，愬愬，终吉。《象》曰：愬愬终吉，志行也。"
	local div111011_2 "履卦 九五爻辞:夬履，贞厉。《象》曰：夬履贞厉，位正当也。"
	local div111011_1 "履卦 上九爻辞:视履考祥，其旋元吉。《象》曰：元吉在上，大有庆也。"
	local div000111_0 "泰卦 卦辞:小往大来，吉亨。《象》曰：天地交，泰。后以财成天地之道，辅相天地之宜，以左右民。"
	local div000111_6 "泰卦 初九爻辞:拔茅茹，以其汇，征吉。《象》曰：拔茅征吉，志在外也。"
	local div000111_5 "泰卦 九二爻辞:包荒，用冯河，不遐遗。朋亡，得尚于中行。《象》曰：包荒，得尚于中行，以光大也。"
	local div000111_4 "泰卦 九三爻辞:无平不陂，无往不复，艰贞无咎。勿恤其孚，于食有福。《象》曰：无往不复，天地际也。"
	local div000111_3 "泰卦 六四爻辞:翩翩，不富以其邻，不戒以孚。《象》曰：翩翩不富，皆失实也。不戒以孚，中心愿也。"
	local div000111_2 "泰卦 六五爻辞:帝乙归妹，以祉元吉。《象》曰：以祉元吉，中以行愿也。"
	local div000111_1 "泰卦 上六爻辞:城复于隍，勿用师。自邑告命，贞吝。《象》曰：城复于隍，其命乱也。"
	local div111000_0 "否卦 卦辞:否之匪人，不利君子贞，大往小来。《象》曰：天地不交，否。君子以俭德辟难，不可荣以禄。"
	local div111000_6 "否卦 初六爻辞:拔茅茹，以其汇，贞吉，亨。《象》曰：拔茅贞吉，志在君也。"
	local div111000_5 "否卦 六二爻辞:包承，小人吉，大人否，亨。《象》曰：大人否，亨，不乱群也。"
	local div111000_4 "否卦 六三爻辞:包羞。《象》曰：包羞，位不当也。"
	local div111000_3 "否卦 九四爻辞:有命无咎，畴离祉。《象》曰：有命无咎，志行也。"
	local div111000_2 "否卦 九五爻辞:休否，大人吉。其亡其亡，系于苞桑。《象》曰：大人之吉，位正当也。"
	local div111000_1 "否卦 上九爻辞:倾否，先否后喜。《象》曰：否终则倾，何可长也。"
	local div111101_0 "同人卦 卦辞:同人于野，亨。利涉大川，利君子贞。《象》曰：天与火，同人。君子以类族辨物。"
	local div111101_6 "同人卦 初九爻辞:同人于门，无咎。《象》曰：出门同人，又谁咎也。"
	local div111101_5 "同人卦 六二爻辞:同人于宗，吝。《象》曰：同人于宗，吝道也。"
	local div111101_4 "同人卦 九三爻辞:伏戎于莽，升其高陵，三岁不兴。《象》曰：伏戎于莽，敌刚也。三岁不兴，安行也。"
	local div111101_3 "同人卦 九四爻辞:乘其墉，弗克攻，吉。《象》曰：乘其墉，义弗克也，其吉，则困而反则也。"
	local div111101_2 "同人卦 九五爻辞:同人，先号咷而后笑。大师克相遇。《象》曰：同人之先，以中直也。大师相遇，言相克也。"
	local div111101_1 "同人卦 上九爻辞:同人于郊，无悔。《象》曰：同人于郊，志未得也。"
	local div101111_0 "大有卦 卦辞:元亨。《象》曰：火在天上，大有。君子以遏恶扬善，顺天休命。"
	local div101111_6 "大有卦 初九爻辞:无交害，匪咎，艰则无咎。《象》曰：大有初九，无交害也。"
	local div101111_5 "大有卦 九二爻辞:大车以载，有攸往，无咎。《象》曰：大车以载，积中不败也。"
	local div101111_4 "大有卦 九三爻辞:公用亨于天子，小人弗克。《象》曰：公用亨于天子，小人害也。"
	local div101111_3 "大有卦 九四爻辞:匪其彭，无咎。《象》曰：匪其彭，无咎，明辨晰也。"
	local div101111_2 "大有卦 六五爻辞:厥孚交如，威如，吉。《象》曰：厥孚交如，信以发志也。威如之吉，易而无备也。"
	local div101111_1 "大有卦 上九爻辞:自天佑之，吉无不利。《象》曰：大有上吉，自天佑也。"
	local div000100_0 "谦卦 卦辞:亨，君子有终。《象》曰：地中有山，谦。君子以裒多益寡，称物平施。"
	local div000100_6 "谦卦 初六爻辞:谦谦君子，用涉大川，吉。《象》曰：谦谦君子，卑以自牧也。"
	local div000100_5 "谦卦 六二爻辞:鸣谦，贞吉。《象》曰：鸣谦贞吉，中心得也。"
	local div000100_4 "谦卦 九三爻辞:劳谦君子，有终，吉。《象》曰：劳谦君子，万民服也。"
	local div000100_3 "谦卦 六四爻辞:无不利，㧑谦。《象》曰：无不利，㧑谦，不违则也。"
	local div000100_2 "谦卦 六五爻辞:不富以其邻，利用侵伐，无不利。《象》曰：利用侵伐，征不服也。"
	local div000100_1 "谦卦 上六爻辞:鸣谦，利用行师，征邑国。《象》曰：鸣谦，志未得也。可用行师，征邑国也。"
	local div001000_0 "豫卦 卦辞:利建侯行师。《象》曰：雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。"
	local div001000_6 "豫卦 初六爻辞:鸣豫，凶。《象》曰：初六鸣豫，志穷凶也。"
	local div001000_5 "豫卦 六二爻辞:介于石，不终日，贞吉。《象》曰：不终日，贞吉；以中正也。"
	local div001000_4 "豫卦 六三爻辞:盱豫，悔。迟有悔。《象》曰：盱豫有悔，位不当也。"
	local div001000_3 "豫卦 九四爻辞:由豫，大有得。勿疑，朋盍簪。《象》曰：由豫大有得，志大行也。"
	local div001000_2 "豫卦 六五爻辞:贞疾，恒不死。《象》曰：六五贞疾，乘刚也。恒不死，中未亡也。"
	local div001000_1 "豫卦 上六爻辞:冥豫，成有渝，无咎。《象》曰：冥豫在上，何可长也？"
	local div011001_0 "随卦 卦辞:元亨利贞，无咎。《象》曰：泽中有雷，随。君子以向晦入宴息。"
	local div011001_6 "随卦 初九爻辞:官有渝，贞吉。出门交有功。《象》曰：官有渝，从正吉也。出门交有功，不失也。"
	local div011001_5 "随卦 六二爻辞:系小子，失丈夫。《象》曰：系小子，弗兼与也。"
	local div011001_4 "随卦 六三爻辞:系丈夫，失小子。随有求，得，利居贞。《象》曰：系丈夫，志舍下也。"
	local div011001_3 "随卦 九四爻辞:随有获，贞凶。有孚，在道以明，何咎？《象》曰：随有获，其义凶也。有孚在道，明功也。"
	local div011001_2 "随卦 九五爻辞:孚于嘉，吉。《象》曰：孚于嘉吉，位正中也。"
	local div011001_1 "随卦 上六爻辞:拘系之，乃从维之。王用亨于西山。《象》曰：拘系之，上穷也。"
	local div100110_0 "蛊卦 卦辞:元亨，利涉大川。先甲三日，后甲三日。《象》曰：山下有风，蛊。君子以振民育德。"
	local div100110_6 "蛊卦 初六爻辞:干父之蛊，有子，考无咎，厉终吉。《象》曰：干父之蛊，意承考也。"
	local div100110_5 "蛊卦 九二爻辞:干母之蛊，不可贞。《象》曰：干母之蛊，得中道也。"
	local div100110_4 "蛊卦 九三爻辞:干父之蛊，小有晦，无大咎。《象》曰：干父之蛊，终无咎也。"
	local div100110_3 "蛊卦 六四爻辞:裕父之蛊，往见吝。《象》曰：裕父之蛊，往未得也。"
	local div100110_2 "蛊卦 六五爻辞:干父之蛊，用誉。《象》曰：干父用誉，承以德也。"
	local div100110_1 "蛊卦 上九爻辞:不事王侯，高尚其事。《象》曰：不事王侯，志可则也。"
	local div000011_0 "临卦 卦辞:元，亨，利，贞。至于八月有凶。《象》曰：泽上有地，临。君子以教思无穷，容保民无疆。"
	local div000011_6 "临卦 初九爻辞:咸临，贞吉。《象》曰：咸临贞吉，志行正也。"
	local div000011_5 "临卦 九二爻辞:咸临，吉，无不利。《象》曰：咸临，吉，无不利，未顺命也。"
	local div000011_4 "临卦 六三爻辞:甘临，无攸利。既忧之，无咎。《象》曰：甘临，位不当也。既忧之，咎不长也。"
	local div000011_3 "临卦 六四爻辞:至临，无咎。《象》曰：至临无咎，位当也。"
	local div000011_2 "临卦 六五爻辞:知临，大君之宜，吉。《象》曰：大君之宜，行中之谓也。"
	local div000011_1 "临卦 上六爻辞:敦临，吉，无咎。《象》曰：敦临之吉，志在内也。"
	local div110000_0 "观卦 卦辞:盥而不荐，有孚颙若。《象》曰：风行地上，观。先王以省方观民设教."
	local div110000_6 "观卦 初六爻辞:童观，小人无咎，君子吝。《象》曰：初六童观，小人道也。"
	local div110000_5 "观卦 六二爻辞:窥观，利女贞。《象》曰：窥观女贞，亦可丑也。"
	local div110000_4 "观卦 六三爻辞:观我生，进退。《象》曰：观我生进退，未失道也。"
	local div110000_3 "观卦 六四爻辞:观国之光，利用宾于王。《象》曰：观国之光，尚宾也。"
	local div110000_2 "观卦 九五爻辞:观我生，君子无咎。《象》曰：观我生，观民也。"
	local div110000_1 "观卦 上九爻辞:观其生，君子无咎。《象》曰：观其生，志未平也。"
	local div101001_0 "噬嗑卦 卦辞:亨。利用狱。《象》曰：雷电噬嗑。先王以明罚敕法。"
	local div101001_6 "噬嗑卦 初九爻辞:履校灭趾，无咎。《象》曰：履校灭趾，不行也。"
	local div101001_5 "噬嗑卦 六二爻辞:噬肤灭鼻，无咎。《象》曰：噬肤灭鼻，乘刚也。"
	local div101001_4 "噬嗑卦 六三爻辞:噬腊肉，遇毒。小吝，无咎。《象》曰：遇毒，位不当也。"
	local div101001_3 "噬嗑卦 九四爻辞:噬干胏，得金矢。利艰贞，吉。《象》曰：利艰贞吉，未光也。"
	local div101001_2 "噬嗑卦 六五爻辞:噬干肉得黄金。贞厉，无咎。《象》曰：贞厉无咎，得当也。"
	local div101001_1 "噬嗑卦 上九爻辞:何校灭耳，凶。《象》曰：何校灭耳，聪不明也。"
	local div100101_0 "贲卦 卦辞:亨。小利有所往。《象》曰：山下有火，贲。君子以明庶政，无敢折狱。"
	local div100101_6 "贲卦 初九爻辞:贲其趾，舍车而徒。《象》曰：舍车而徒，义弗乘也。"
	local div100101_5 "贲卦 六二爻辞:贲其须。《象》曰：贲其须，与上兴也。"
	local div100101_4 "贲卦 九三爻辞:贲如，濡如，永贞吉。《象》曰：永贞之吉，终莫之陵也。"
	local div100101_3 "贲卦 六四爻辞:贲如，皤如，白马翰如，匪寇婚媾。《象》曰：六四，当位疑也。匪寇婚媾，终无尤也。"
	local div100101_2 "贲卦 六五爻辞:贲于丘园，束帛戋戋。吝，终吉。《象》曰：六五之吉，有喜也。"
	local div100101_1 "贲卦 上九爻辞:白贲，无咎。《象》曰：白贲无咎，上得志也。"
	local div100000_0 "剥卦 卦辞:不利有攸往。《象》曰：山附地上，剥。上以厚下安宅。"
	local div100000_6 "剥卦 初六爻辞:剥床以足，蔑贞，凶。《象》曰：剥床以足，以灭下也。"
	local div100000_5 "剥卦 六二爻辞:剥床以辨，蔑贞，凶。《象》曰：剥床以辨，未有与也。"
	local div100000_4 "剥卦 六三爻辞:剥之，无咎。《象》曰：剥之无咎，失上下也。"
	local div100000_3 "剥卦 六四爻辞:剥床以肤，凶。《象》曰：剥床以肤，切近灾也。"
	local div100000_2 "剥卦 六五爻辞:贯鱼。以宫人宠，无不利。《象》曰：以宫人宠，终无尤也。"
	local div100000_1 "剥卦 上九爻辞:硕果不食，君子得舆，小人剥庐。《象》曰：君子得舆，民所载也。小人剥庐，终不可用也。"
	local div000001_0 "复卦 卦辞:亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。《象》曰：雷在地中，复。先王以至日闭关，商旅不行，后不省方。"
	local div000001_6 "复卦 初九爻辞:不远复，无祗悔，元吉。《象》曰：不远之复，以修身也。"
	local div000001_5 "复卦 六二爻辞:休复，吉。《象》曰：休复之吉，以下仁也。"
	local div000001_4 "复卦 六三爻辞:频复，厉，无咎。《象》曰：频复之厉，义无咎也。"
	local div000001_3 "复卦 六四爻辞:中行独复。《象》曰：中行独复，以从道也。"
	local div000001_2 "复卦 六五爻辞:敦复，无悔。《象》曰：敦复无悔，中以自考也。"
	local div000001_1 "复卦 上六爻辞:迷复，凶，有灾眚。用行师，终有大败，以其国君凶，至于十年，不克征。《象》曰：迷复之凶，反君道也。"
	local div111001_0 "无妄卦 卦辞:元亨利贞。其匪正有眚，不利有攸往。《象》曰：天下雷行，物与无妄。先王以茂对时，育万物。"
	local div111001_6 "无妄卦 初九爻辞:无妄，往吉。《象》曰：无妄之往，得志也。"
	local div111001_5 "无妄卦 六二爻辞:不耕获，不菑畲，则利有攸往。《象》曰：不耕获，未富也。"
	local div111001_4 "无妄卦 六三爻辞:无妄之灾。或系之牛，行人之得，邑人之灾。《象》曰：行人得牛，邑人灾也。"
	local div111001_3 "无妄卦 九四爻辞:可贞，无咎。《象》曰：象曰：可贞无咎，固有之也。"
	local div111001_2 "无妄卦 九五爻辞:无妄之疾，勿药有喜。《象》曰：无妄之药，不可试也。"
	local div111001_1 "无妄卦 上九爻辞:无妄，行有眚，无攸利。《象》曰：无妄之行，穷之灾也。"
	local div100111_0 "大畜卦 卦辞:利贞，不家食吉，利涉大川。《象》曰：天在山中，大畜。君子以多识前言往行，以畜其德。"
	local div100111_6 "大畜卦 初九爻辞:有厉，利已。《象》曰：有厉利已，不犯灾也。"
	local div100111_5 "大畜卦 九二爻辞:舆说辐。《象》曰：舆说辐，中无尤也。"
	local div100111_4 "大畜卦 九三爻辞:良马逐，利艰贞。曰闲舆卫，利有攸往。《象》曰：利有攸往，上合志也。"
	local div100111_3 "大畜卦 六四爻辞:童牛之牿，元吉。《象》曰：六四元吉，有喜也。"
	local div100111_2 "大畜卦 六五爻辞:豶豕之牙，吉。《象》曰：六五之吉，有庆也。"
	local div100111_1 "大畜卦 上九爻辞:何天之衢，亨。《象》曰：何天之衢，道大行也。"
	local div100001_0 "颐卦 卦辞:贞吉。观颐，自求口实。《象》曰：山下有雷，颐。君子以慎言语，节饮食。"
	local div100001_6 "颐卦 初九爻辞:舍尔灵龟，观我朵颐，凶。《象》曰：观我朵颐，亦不足贵也。"
	local div100001_5 "颐卦 六二爻辞:颠颐，拂经，于丘颐，征凶。《象》曰：六二征凶，行失类也。"
	local div100001_4 "颐卦 六三爻辞:拂颐，贞凶。十年勿用，无攸利。《象》曰：十年勿用，道大悖也。"
	local div100001_3 "颐卦 六四爻辞:颠颐，吉。虎视眈眈，其欲逐逐，无咎。《象》曰：颠颐之吉，上施光也。"
	local div100001_2 "颐卦 六五爻辞:拂经，居贞吉，不可涉大川。《象》曰：居贞之吉，顺以从上也。"
	local div100001_1 "颐卦 上九爻辞:由颐，厉吉。利涉大川。《象》曰：由颐厉吉，大有庆也。"
	local div011110_0 "大过卦 卦辞:栋桡，利有攸往，亨。《象》曰：泽灭木，大过。君子以独立不惧，遯世无闷。"
	local div011110_6 "大过卦 初六爻辞:藉用白茅，无咎。《象》曰：藉用白茅，柔在下也。"
	local div011110_5 "大过卦 九二爻辞:枯杨生稊，老夫得其女妻，无不利。《象》曰：老夫女妻，过以相与也。"
	local div011110_4 "大过卦 九三爻辞:栋桡，凶。《象》曰：栋桡之凶，不可以有辅也。"
	local div011110_3 "大过卦 九四爻辞:栋隆，吉。它吝。《象》曰：栋隆之吉，不桡乎下也。"
	local div011110_2 "大过卦 九五爻辞:枯杨生华，老妇得士夫，无咎无誉。《象》曰：枯杨生华，何可久也？老妇士夫，亦可丑也。"
	local div011110_1 "大过卦 上六爻辞:过涉灭顶，凶，无咎。《象》曰：过涉之凶，不可咎也。"
	local div010010_0 "坎卦 卦辞:习坎，有孚。维心亨。行有尚。《象》曰：水洊至，习坎。君子以常德行，习教事。"
	local div010010_6 "坎卦 初六爻辞:习坎，入于坎窞，凶。《象》曰：习坎入坎，失道凶也。"
	local div010010_5 "坎卦 九二爻辞:坎有险，求小得。《象》曰：求小得，未出中也。"
	local div010010_4 "坎卦 六三爻辞:来之坎坎，险且枕，入于坎窞，勿用。《象》曰：来之坎坎，终无功也。"
	local div010010_3 "坎卦 六四爻辞:樽酒簋贰，用缶，纳约自牖，终无咎。《象》曰：樽酒簋贰，刚柔际也。"
	local div010010_2 "坎卦 九五爻辞:坎不盈，祗既平，无咎。《象》曰：坎不盈，中未大也。"
	local div010010_1 "坎卦 上六爻辞:系用徽繹，置于丛棘，三岁不得，凶。《象》曰：上六失道，凶三岁也。"
	local div101101_0 "离卦 卦辞:利贞，亨。畜牝牛，吉。《象》曰：明两作，离。大人以继明照于四方。"
	local div101101_6 "离卦 初九爻辞:履错然，敬之无咎。《象》曰：履错之敬，以辟咎也。"
	local div101101_5 "离卦 六二爻辞:黄离，元吉。《象》曰：黄离元吉，得中道也。"
	local div101101_4 "离卦 九三爻辞:日昃之离，不鼓缶而歌，则大耋之嗟，凶。《象》曰：日昃之离，何可久也。"
	local div101101_3 "离卦 九四爻辞:突如其来如，焚如，死如，弃如。《象》曰：突如其来如，无所容也。"
	local div101101_2 "离卦 六五爻辞:出涕沱若，戚嗟若，吉。《象》曰：六五之吉，离王公也。"
	local div101101_1 "离卦 上九爻辞:王用出征，有嘉。折首，获其匪丑，无咎。《象》曰：王用出征，以正邦也。"
	local div011100_0 "咸卦 卦辞:亨，利贞。取女吉。《象》曰：山上有泽，咸。君子以虚受人。"
	local div011100_6 "咸卦 初六爻辞:咸其拇。《象》曰：咸其拇，志在外也。"
	local div011100_5 "咸卦 六二爻辞:咸其腓，凶，居吉。《象》曰：虽凶居吉，顺不害也。"
	local div011100_4 "咸卦 九三爻辞:咸其股，执其随，往吝。《象》曰：咸其股，亦不处也。志在随人，所执下也。"
	local div011100_3 "咸卦 九四爻辞:贞吉悔亡，憧憧往来，朋从尔思。《象》曰：贞吉悔亡，未感害也。憧憧往来，未光大也。"
	local div011100_2 "咸卦 九五爻辞:咸其脢，无悔。《象》曰：咸其脢，志末也。"
	local div011100_1 "咸卦 上六爻辞:咸其辅，颊，舌。《象》曰：咸其辅，颊，舌，滕口说也。"
	local div001110_0 "恒卦 卦辞:亨，无咎，利贞。利有攸往。《象》曰：雷风，恒。君子以立不易方。"
	local div001110_6 "恒卦 初六爻辞:浚恒，贞凶，无攸利。《象》曰：浚恒之凶，始求深也。"
	local div001110_5 "恒卦 九二爻辞:悔亡。《象》曰：九二悔亡，能久中也。"
	local div001110_4 "恒卦 九三爻辞:不恒其德，或承之羞，贞吝。《象》曰：不恒其德，无所容也。"
	local div001110_3 "恒卦 九四爻辞:田无禽。《象》曰：久非其位，安得禽也？"
	local div001110_2 "恒卦 六五爻辞:恒其德，贞。妇人吉，夫子凶。《象》曰：妇人贞吉，从一而终也。夫子制义，从妇凶也。"
	local div001110_1 "恒卦 上六爻辞:振恒，凶。《象》曰：振恒在上，大无功也。"
	local div111100_0 "遁卦 卦辞:亨。小利贞。《象》曰：天下有山，遁。君子以远小人，不恶而严。"
	local div111100_6 "遁卦 初六爻辞:遁尾，厉。勿用有攸往。《象》曰：遁尾之厉，不往何灾也。"
	local div111100_5 "遁卦 六二爻辞:执之用黄牛之革，莫之胜说。《象》曰：执用黄牛，固志也。"
	local div111100_4 "遁卦 九三爻辞:系遁，有疾厉，畜臣妾，吉。《象》曰：系遁之厉，有疾惫也。畜臣妾吉，不可大事也。"
	local div111100_3 "遁卦 九四爻辞:好遁。君子吉，小人否。《象》曰：君子好遁，小人否也。"
	local div111100_2 "遁卦 九五爻辞:嘉遁，贞吉。《象》曰：嘉遁贞吉，以正志也。"
	local div111100_1 "遁卦 上九爻辞:肥遁，无不利。《象》曰：肥遁，无不利，无所疑也。"
	local div001111_0 "大壮卦 卦辞:利贞。《象》曰：雷在天上，大壮。君子以非礼弗履。"
	local div001111_6 "大壮卦 初九爻辞:壮于趾，征凶，有孚。《象》曰：壮于趾，其孚穷也。"
	local div001111_5 "大壮卦 九二爻辞:贞吉。《象》曰：九二贞吉，以中也。"
	local div001111_4 "大壮卦 九三爻辞:小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。《象》曰：小人用壮，君子罔也。"
	local div001111_3 "大壮卦 九四爻辞:贞吉悔亡，藩决不羸，壮于大舆之輹。《象》曰：藩决不羸，尚往也。"
	local div001111_2 "大壮卦 六五爻辞:丧羊于易，无悔。《象》曰：丧羊于易，位不当也。"
	local div001111_1 "大壮卦 上六爻辞:羝羊触藩，不能退，不能遂，无攸利，艰则吉。《象》曰：不能退，不能遂，不祥也。艰则吉，咎不长也。"
	local div101000_0 "晋卦 卦辞:康侯用锡马蕃庶，昼日三接。《象》曰：明出地上，晋。君子以自昭明德。"
	local div101000_6 "晋卦 初六爻辞:晋如，摧如，贞吉。罔孚，裕无咎。《象》曰：晋如摧如，独行正也。裕无咎，未受命也。"
	local div101000_5 "晋卦 六二爻辞:晋如，愁如，贞吉。受兹介福，于其王母。《象》曰：受兹介福，以中正也。"
	local div101000_4 "晋卦 六三爻辞:众允，悔亡。《象》曰：众允之志，上行也。"
	local div101000_3 "晋卦 九四爻辞:晋如硕鼠，贞厉。《象》曰：硕鼠贞厉，位不当也。"
	local div101000_2 "晋卦 六五爻辞:悔亡，失得勿恤，往吉，无不利。《象》曰：失得勿恤，往有庆也。"
	local div101000_1 "晋卦 上九爻辞:晋其角，维用伐邑。厉吉无咎，贞吝。《象》曰：维用伐邑，道未光也。"
	local div000101_0 "明夷卦 卦辞:利艰贞。《象》曰：明入地中，明夷。君子以莅众用晦而明。"
	local div000101_6 "明夷卦 初九爻辞:明夷于飞，垂其翼。君子于行，三日不食。有攸往，主人有言。《象》曰：君子于行，义不食也。"
	local div000101_5 "明夷卦 六二爻辞:明夷，夷于左股，用拯马壮，吉。《象》曰：六二之吉，顺以则也。"
	local div000101_4 "明夷卦 九三爻辞:明夷于南狩，得其大首，不可疾，贞。《象》曰：南狩之志，乃大得也。"
	local div000101_3 "明夷卦 六四爻辞:入于左腹，获明夷之心，于出门庭。《象》曰：入于左腹，获心意也。"
	local div000101_2 "明夷卦 六五爻辞:箕子之明夷，利贞。《象》曰：箕子之贞，明不可息也。"
	local div000101_1 "明夷卦 上六爻辞:不明，晦。初登于天，后入于地。《象》曰：初登于天，照四国也。后入于地，失则也。"
	local div110101_0 "家人卦 卦辞:利女贞。《象》曰：风自火出，家人。君子以言有物而行有恒。"
	local div110101_6 "家人卦 初九爻辞:闲有家，悔亡。《象》曰：闲有家，志未变也。"
	local div110101_5 "家人卦 六二爻辞:无攸遂，在中馈。贞吉《象》曰：六二之吉，顺以巽也。"
	local div110101_4 "家人卦 九三爻辞:家人嗃嗃，悔厉吉；妇子嘻嘻，终吝。《象》曰：家人嗃嗃，未失也。妇子嘻嘻，失家节也。"
	local div110101_3 "家人卦 六四爻辞:富家，大吉。《象》曰：富家大吉，顺在位也。"
	local div110101_2 "家人卦 九五爻辞:王假有家，勿恤，吉。《象》曰：王假有家，交相爱也。"
	local div110101_1 "家人卦 上九爻辞:有孚威如，终吉。《象》曰：威如之吉，反身之谓也。"
	local div101011_0 "睽卦 卦辞:小事吉。《象》曰：上火下泽，睽。君子以同而异。"
	local div101011_6 "睽卦 初九爻辞:悔亡，丧马勿逐，自复。见恶人，无咎。《象》曰：见恶人，以辟咎也。"
	local div101011_5 "睽卦 九二爻辞:遇主于巷，无咎。《象》曰：遇主于巷，未失道也。"
	local div101011_4 "睽卦 六三爻辞:见舆曳，其牛掣，其人天且劓，无初有终。《象》曰：见舆曳，位不当也。无初有终，遇刚也。"
	local div101011_3 "睽卦 九四爻辞:睽孤，遇元夫。交孚，厉无咎。《象》曰：交孚无咎，志行也。"
	local div101011_2 "睽卦 六五爻辞:悔亡，厥宗噬肤，往何咎？《象》曰：厥宗噬肤，往有庆也。"
	local div101011_1 "睽卦 上九爻辞:睽孤，见豕负涂，载鬼一车。先张之弧，后说之弧。匪寇婚媾，往遇雨则吉。《象》曰：遇雨之吉，群疑亡也。"
	local div010100_0 "蹇卦 卦辞:利西南，不利东北。利见大人，贞吉。《象》曰：山上有水，蹇。君子以反身修德。"
	local div010100_6 "蹇卦 初六爻辞:往蹇来誉。《象》曰：往蹇来誉，宜待也。"
	local div010100_5 "蹇卦 六二爻辞:王臣蹇蹇，匪躬之故。《象》曰：王臣蹇蹇，终无尤也。"
	local div010100_4 "蹇卦 九三爻辞:往蹇来反。《象》曰：往蹇来反，内喜之也。"
	local div010100_3 "蹇卦 六四爻辞:往蹇来连。《象》曰：往蹇来连，当位实也。"
	local div010100_2 "蹇卦 九五爻辞:大蹇，朋来。《象》曰：大蹇朋来，以中节也。"
	local div010100_1 "蹇卦 上六爻辞:往蹇来硕，吉。利见大人。《象》曰：往蹇来硕，志在内也。利见大人，以从贵也。"
	local div001010_0 "解卦 卦辞:利西南，无所往，其来复吉。有攸往，夙吉。《象》曰：雷雨作，解。君子以赦过宥罪。"
	local div001010_6 "解卦 初六爻辞:无咎。《象》曰：刚柔之际，义无咎也。"
	local div001010_5 "解卦 九二爻辞:田获三狐，得黄矢，贞吉。《象》曰：九二贞吉，得中道也。"
	local div001010_4 "解卦 六三爻辞:负且乘，致寇至，贞吝。《象》曰：负且乘，亦可丑也。自我致戎，又谁咎也。"
	local div001010_3 "解卦 九四爻辞:解而拇，朋至斯孚。《象》曰：解而拇，未当位也。"
	local div001010_2 "解卦 六五爻辞:君子维有解，吉，有孚于小人。《象》曰：君子有解，小人退也。"
	local div001010_1 "解卦 上六爻辞:公用射隼于高墉之上，获之无不利。《象》曰：公用射隼，以解悖也。"
	local div100011_0 "损卦 卦辞:有孚，元吉，无咎，可贞。利有攸往。曷之用？二簋可用享。《象》曰：山下有泽，损。君子以惩忿窒欲。"
	local div100011_6 "损卦 初九爻辞:已事遄往，无咎。酌损之。《象》曰：已事遄往，尚合志也。"
	local div100011_5 "损卦 九二爻辞:利贞，征凶。弗损，益之。《象》曰：九二利贞，中以为志也。"
	local div100011_4 "损卦 六三爻辞:三人行则损一人，一人行则得其友。《象》曰：一人行，三则疑也。"
	local div100011_3 "损卦 六四爻辞:损其疾，使遄有喜，无咎。《象》曰：损其疾，亦可喜也。"
	local div100011_2 "损卦 六五爻辞:或益之十朋之龟，弗克违。元吉。《象》曰：六五元吉，自上佑也。"
	local div100011_1 "损卦 上九爻辞:弗损，益之，无咎，贞吉，利有攸往，得臣无家。《象》曰：弗损益之，大得志也"
	local div110001_0 "益卦 卦辞:利有攸往，利涉大川。《象》曰：风雷，益。君子以见善则迁，有过则改。"
	local div110001_6 "益卦 初九爻辞:利用为大作，元吉，无咎。《象》曰：元吉无咎，下不厚事也。"
	local div110001_5 "益卦 六二爻辞:或益之十朋之龟，弗克违。永贞吉。王用享于帝，吉。《象》曰：或益之，自外来也。"
	local div110001_4 "益卦 六三爻辞:益之用凶事，无咎。有孚中行，告公用圭。《象》曰：益用凶事，固有之也。"
	local div110001_3 "益卦 六四爻辞:中行，告公从，利用为依迁国。《象》曰：告公从，以益志也。"
	local div110001_2 "益卦 九五爻辞:有孚惠心，勿问元吉。有孚惠我德。《象》曰：有孚惠心，勿问之矣。惠我德，大得志也。"
	local div110001_1 "益卦 上九爻辞:莫益之，或击之，立心勿恒，凶。《象》曰：莫益之，偏辞也。或击之，自外来也。"
	local div011111_0 "夬卦 卦辞:扬于王庭。孚号有厉。告自邑，不利即戎，利有攸往。《象》曰：泽上于天，夬。君子以施禄及下，居德则忌。"
	local div011111_6 "夬卦 初九爻辞:壮于前趾，往不胜为吝。《象》曰：不胜而往，咎也。"
	local div011111_5 "夬卦 九二爻辞:惕号，莫夜有戎，勿恤。《象》曰：有戎勿恤，得中道也。"
	local div011111_4 "夬卦 九三爻辞:壮于頄，有凶。君子夬夬独行，遇雨若濡，有愠无咎。《象》曰：君子夬夬，终无咎也。"
	local div011111_3 "夬卦 九四爻辞:臀无肤，其行次且。牵羊悔亡，闻言不信。《象》曰：其行次且，位不当也。闻言不信，聪不明也。"
	local div011111_2 "夬卦 九五爻辞:苋陆夬夬，中行无咎。《象》曰：中行无咎，中未光也。"
	local div011111_1 "夬卦 上六爻辞:无号，终有凶。《象》曰：无号之凶，终不可长也。"
	local div111110_0 "姤卦 卦辞:女壮，勿用取女。《象》曰：天下有风，姤；后以施命诰四方。"
	local div111110_6 "姤卦 初六爻辞:系于金柅，贞吉。有攸往，见凶，羸豕踟躅。《象》曰：系于金柅，柔道牵也。"
	local div111110_5 "姤卦 九二爻辞:包有鱼，无咎，不利宾。《象》曰：包有鱼，义不及宾也。"
	local div111110_4 "姤卦 九三爻辞:臀无肤，其行次且，厉，无大咎。《象》曰：其行次且，行未牵也。"
	local div111110_3 "姤卦 九四爻辞:包无鱼，起凶。《象》曰：无鱼之凶，远民也。"
	local div111110_2 "姤卦 九五爻辞:以杞包瓜，含章，有陨自天。《象》曰：九五含章，中正也。有陨自天，志不舍命也。"
	local div111110_1 "姤卦 上九爻辞:姤其角，吝，无咎。《象》曰：姤其角，上穷吝也。"
	local div011000_0 "萃卦 卦辞:亨。王假有庙。利见大人，亨，利贞。用大牲吉，利有攸往。《象》曰：泽上于地，萃。君子以除戎器，戒不虞。"
	local div011000_6 "萃卦 初六爻辞:有孚不终，乃乱乃萃。若号，一握为笑。勿恤，往无咎。《象》曰：乃乱乃萃，其志乱也。"
	local div011000_5 "萃卦 六二爻辞:引吉，无咎，孚乃利用禴。《象》曰：引吉无咎，中未变也。"
	local div011000_4 "萃卦 六三爻辞:萃如，嗟如，无攸利。往无咎，小吝。《象》曰：往无咎，上巽也。"
	local div011000_3 "萃卦 九四爻辞:大吉，无咎。《象》曰：大吉无咎，位不当也。"
	local div011000_2 "萃卦 九五爻辞:萃有位，无咎。匪孚，元永贞，悔亡。《象》曰：萃有位，志未光也。"
	local div011000_1 "萃卦 上六爻辞:赍咨涕洟，无咎。《象》曰：赍咨涕洟，未安上也。"
	local div000110_0 "升卦 卦辞:元亨，用见大人，勿恤，南征吉。《象》曰：地中生木，升。君子以顺德，积小以高大。"
	local div000110_6 "升卦 初六爻辞:允升，大吉。《象》曰：允升大吉，上合志也。"
	local div000110_5 "升卦 九二爻辞:孚乃利用禴，无咎。《象》曰：九二之孚，有喜也。"
	local div000110_4 "升卦 九三爻辞:升虚邑。《象》曰：升虚邑，无所疑也。"
	local div000110_3 "升卦 六四爻辞:王用亨于岐山，吉，无咎。《象》曰：王用亨于岐山，顺事也。"
	local div000110_2 "升卦 六五爻辞:贞吉，升阶。《象》曰：贞吉升阶，大得志也。"
	local div000110_1 "升卦 上六爻辞:冥升，利于不息之贞。《象》曰：冥升在上，消不富也。"
	local div011010_0 "困卦 卦辞:亨，贞，大人吉，无咎。有言不信。《象》曰：泽无水，困。君子以致命遂志。"
	local div011010_6 "困卦 初六爻辞:臀困于株木，入于幽谷，三岁不觌。《象》曰：入于幽谷，幽不明也。"
	local div011010_5 "困卦 九二爻辞:困于酒食，朱绂方来，利用亨祀。征凶，无咎。《象》曰：困于酒食，中有庆也。"
	local div011010_4 "困卦 六三爻辞:困于石，据于蒺藜，入于其宫，不见其妻，凶。《象》曰：据于蒺藜，乘刚也。入于其宫，不见其妻，不祥也。"
	local div011010_3 "困卦 九四爻辞:来徐徐，困于金车，吝，有终。《象》曰：来徐徐，志在下也。虽不当位，有与也。"
	local div011010_2 "困卦 九五爻辞:劓刖，困于赤绂，乃徐有说，利用祭祀。《象》曰：劓刖，志未得也。乃徐有说，以中直也。利用祭祀，受福也。"
	local div011010_1 "困卦 上六爻辞:困于葛藟，于臲卼，曰动悔。有悔，征吉。《象》曰：困于葛藟，未当也。动悔有悔，吉行也。"
	local div010110_0 "井卦 卦辞:改邑不改井，无丧无得。往来井井。汔至亦未繘井，羸其瓶，凶。《象》曰：木上有水，井。君子以劳民劝相。"
	local div010110_6 "井卦 初六爻辞:井泥不食，旧井无禽。《象》曰：井泥不食，下也。旧井无禽，时舍也。"
	local div010110_5 "井卦 九二爻辞:井谷射鲋，瓮敝漏。《象》曰：井谷射鲋，无与也。"
	local div010110_4 "井卦 九三爻辞:井渫不食，为我心恻。可用汲，王明，并受其福。《象》曰：井渫不食，行恻也。求王明，受福也。"
	local div010110_3 "井卦 六四爻辞:井甃，无咎。《象》曰：井甃无咎，修井也。"
	local div010110_2 "井卦 九五爻辞:井冽寒泉，食。《象》曰：寒泉之食，中正也。"
	local div010110_1 "井卦 上六爻辞:井收勿幕，有孚元吉。《象》曰：元吉在上，大成也。"
	local div011101_0 "革卦 卦辞:己日乃孚。元亨利贞。悔亡。《象》曰：泽中有火，革。君子以治历明时。"
	local div011101_6 "革卦 初九爻辞:巩用黄牛之革。《象》曰：巩用黄牛，不可以有为也。"
	local div011101_5 "革卦 六二爻辞:己日乃革之，征吉，无咎。《象》曰：己日革之，行有嘉也。"
	local div011101_4 "革卦 九三爻辞:征凶贞厉。革言三就，有孚。《象》曰：革言三就，又何之矣。"
	local div011101_3 "革卦 九四爻辞:悔亡，有孚，改命，吉。《象》曰：改命之吉，信志也。"
	local div011101_2 "革卦 九五爻辞:大人虎变，未占有孚。《象》曰：大人虎变，其文炳也。"
	local div011101_1 "革卦 上六爻辞:君子豹变，小人革面，征凶，居贞吉。《象》曰：君子豹变，其文蔚也。小人革面，顺以从君也。"
	local div101110_0 "鼎卦 卦辞:元吉，亨。《象》曰：木上有火，鼎。君子以正位凝命。"
	local div101110_6 "鼎卦 初六爻辞:鼎颠趾，利出否。得妾以其子，无咎。《象》曰：鼎颠趾，未悖也。利出否，以从贵也。"
	local div101110_5 "鼎卦 九二爻辞:鼎有实，我仇有疾，不我能即，吉。《象》曰：鼎有实，慎所之也。我仇有疾，终无尤也。"
	local div101110_4 "鼎卦 九三爻辞:鼎耳革，其行塞，雉膏不食。方雨，亏悔，终吉。《象》曰：鼎耳革，失其义也。"
	local div101110_3 "鼎卦 九四爻辞:鼎折足，覆公餗，其形渥，凶。《象》曰：覆公餗，信如何也？"
	local div101110_2 "鼎卦 六五爻辞:鼎黄耳金铉，利贞。《象》曰：鼎黄耳，中以为实也。"
	local div101110_1 "鼎卦 上九爻辞:鼎玉铉，大吉，无不利。《象》曰：玉铉在上，刚柔节也。"
	local div001001_0 "震卦 卦辞:亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。《象》曰：洊雷，震。君子以恐惧修身。"
	local div001001_6 "震卦 初九爻辞:震来虩虩，后笑言哑哑，吉。《象》曰：震来虩虩，恐致福也。笑言哑哑，后有则也。"
	local div001001_5 "震卦 六二爻辞:震来厉，亿丧贝，跻于九陵，勿逐，七日得。《象》曰：震来厉，乘刚也。"
	local div001001_4 "震卦 六三爻辞:震苏苏，震行无眚。《象》曰：震苏苏，位不当也。"
	local div001001_3 "震卦 九四爻辞:震遂泥。《象》曰：震遂泥，未光也。"
	local div001001_2 "震卦 六五爻辞:震往来厉，亿无丧，有事。《象》曰：震往来厉，危行也。其事在中，大无丧也。"
	local div001001_1 "震卦 上六爻辞:震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。《象》曰：震索索，未得中也。虽凶无咎，畏邻戒也。"
	local div100100_0 "艮卦 卦辞:艮其背，不获其身，行其庭，不见其人，无咎。《象》曰：兼山，艮；君子以思不出其位。"
	local div100100_6 "艮卦 初六爻辞:艮其趾，无咎。利永贞。《象》曰：艮其趾，未失正也。"
	local div100100_5 "艮卦 六二爻辞:艮其腓，不拯其随，其心不快。《象》曰：不拯其随，未退听也。"
	local div100100_4 "艮卦 九三爻辞:艮其限，列其夤，厉薰心。《象》曰：艮其限，危薰心也。"
	local div100100_3 "艮卦 六四爻辞:艮其身，无咎。《象》曰：艮其身，止诸躬也。"
	local div100100_2 "艮卦 六五爻辞:艮其辅，言有序，悔亡。《象》曰：艮其辅，以中正也。"
	local div100100_1 "艮卦 上九爻辞:敦艮，吉。《象》曰：敦艮之吉，以厚终也。"
	local div110100_0 "渐卦 卦辞:女归吉，利贞。《象》曰：山上有木，渐。君子以居贤德善俗。"
	local div110100_6 "渐卦 初六爻辞:鸿渐于干，小子厉，有言，无咎。《象》曰：小子之厉，义无咎也。"
	local div110100_5 "渐卦 六二爻辞:鸿渐于磐，饮食衍衍，吉。《象》曰：饮食衍衍，不素饱也。"
	local div110100_4 "渐卦 九三爻辞:鸿渐于陆。夫征不复，妇孕不育，凶。利御寇。《象》曰：夫征不复，离群丑也。妇孕不育，失其道也。利用御寇，顺相保也。"
	local div110100_3 "渐卦 六四爻辞:鸿渐于木，或得其桷，无咎。《象》曰：或得其桷，顺以巽也。"
	local div110100_2 "渐卦 九五爻辞:鸿渐于陵，妇三岁不孕，终莫之胜，吉。《象》曰：终莫之胜，吉，得所愿也。"
	local div110100_1 "渐卦 上九爻辞:鸿渐于逵，其羽可用为仪，吉。《象》曰：其羽可用为仪吉，不可乱也。"
	local div001011_0 "归妹卦 卦辞:征凶，无攸利。《象》曰：泽上有雷，归妹。君子以永终知敝。"
	local div001011_6 "归妹卦 初九爻辞:归妹以娣，跛能履，征吉。《象》曰：归妹以娣，以恒也。跛能履，吉相承也。"
	local div001011_5 "归妹卦 九二爻辞:眇能视，利幽人之贞。《象》曰：利幽人之贞，未变常也。"
	local div001011_4 "归妹卦 六三爻辞:归妹以须，反归以娣。《象》曰：归妹以须，未当也。"
	local div001011_3 "归妹卦 九四爻辞:归妹愆期，迟归有时。《象》曰：愆期之志，有待而行也。"
	local div001011_2 "归妹卦 六五爻辞:帝乙归妹，其君之袂不如其娣之袂良，月几望，吉。《象》曰：帝乙归妹，不如其娣之袂良也。其位在中，以贵行也。"
	local div001011_1 "归妹卦 上六爻辞:女承筐无实，士刲羊无血，无攸利。《象》曰：上六无实，承虚筐也。"
	local div001101_0 "丰卦 卦辞:亨。王假之，勿忧，宜日中。《象》曰：雷电皆至，丰。君子以折狱致刑。"
	local div001101_6 "丰卦 初九爻辞:遇其配主，虽旬无咎，往有尚。《象》曰：虽旬无咎，过旬灾也。"
	local div001101_5 "丰卦 六二爻辞:丰其蔀，日中见斗。往得疑疾，有孚发若，吉。《象》曰：有孚发若，信以发志也。"
	local div001101_4 "丰卦 九三爻辞:丰其沛，日中见昧，折其右肱，无咎。《象》曰：丰其沛，不可大事也。折其右肱，终不可用也。"
	local div001101_3 "丰卦 九四爻辞:丰其蔀，日中见斗，遇其夷主，吉。《象》曰：丰其蔀，位不当也。日中见斗，幽不明也。遇其夷主，吉行也。"
	local div001101_2 "丰卦 六五爻辞:来章，有庆誉，吉。《象》曰：六五之吉，有庆也。"
	local div001101_1 "丰卦 上六爻辞:丰其屋，蔀其家，窥其户，阒其无人，三岁不觌，凶。《象》曰：丰其屋，天际翔也。窥其户，阒其无人，自藏也。"
	local div101100_0 "旅卦 卦辞:小亨，旅贞吉。《象》曰：山上有火，旅。君子以明慎用刑而不留狱。"
	local div101100_6 "旅卦 初六爻辞:旅琐琐，斯其所取灾。《象》曰：旅琐琐，志穷灾也。"
	local div101100_5 "旅卦 六二爻辞:旅即次，怀其资，得童仆，贞。《象》曰：得童仆贞，终无尤也。"
	local div101100_4 "旅卦 九三爻辞:旅焚其次，丧其童仆，贞厉。《象》曰：旅焚其次，亦以伤矣。以旅与下，其义丧也。"
	local div101100_3 "旅卦 九四爻辞:旅于处，得其资斧，我心不快。《象》曰：旅于处，未得位也。得其资斧，心未快也。"
	local div101100_2 "旅卦 六五爻辞:射雉，一矢亡，终以誉命。《象》曰：终以誉命，上逮也。"
	local div101100_1 "旅卦 上九爻辞:鸟焚其巢，旅人先笑后号咷。丧牛于易，凶。《象》曰：以旅在上，其义焚也。丧牛于易，终莫之闻也。"
	local div110110_0 "巽卦 卦辞:小亨。利有攸往，利见大人。《象》曰：随风，巽。君子以申命行事。"
	local div110110_6 "巽卦 初六爻辞:进退，利武人之贞。《象》曰：进退，志疑也。利武人之贞，志治也。"
	local div110110_5 "巽卦 九二爻辞:巽在床下，用史巫纷若，吉，无咎。《象》曰：纷若之吉，得中也。"
	local div110110_4 "巽卦 九三爻辞:频巽，吝。《象》曰：频巽之吝，志穷也。"
	local div110110_3 "巽卦 六四爻辞:悔亡，田获三品。《象》曰：田获三品，有功也。"
	local div110110_2 "巽卦 九五爻辞:贞吉，悔亡，无不利。无初有终。先庚三日，后庚三日，吉。《象》曰：九五之吉，位正中也。"
	local div110110_1 "巽卦 上九爻辞:巽在床下，丧其资斧，贞凶。《象》曰：巽在床下，上穷也。丧其资斧，正乎凶也。"
	local div011011_0 "兑卦 卦辞:亨，利贞。《象》曰：丽泽，兑。君子以朋友讲习。"
	local div011011_6 "兑卦 初九爻辞:和兑，吉。《象》曰：和兑之吉，行未疑也。"
	local div011011_5 "兑卦 九二爻辞:孚兑，吉，悔亡。《象》曰：孚兑之吉，信志也。"
	local div011011_4 "兑卦 六三爻辞:来兑，凶。《象》曰：来兑之凶，位不当也。"
	local div011011_3 "兑卦 九四爻辞:商未宁，介疾有喜。《象》曰：九四之喜，有庆也。"
	local div011011_2 "兑卦 九五爻辞:孚于剥，有厉。《象》曰：孚于剥，位正当也。"
	local div011011_1 "兑卦 上六爻辞:引兑。《象》曰：上六引兑，未光也。"
	local div110010_0 "涣卦 卦辞:亨。王假有庙。利涉大川，利贞。《象》曰：风行水上，涣。先王以享于帝，立庙。"
	local div110010_6 "涣卦 初六爻辞:用拯马壮，吉。《象》曰：初六之吉，顺也。"
	local div110010_5 "涣卦 九二爻辞:涣奔其机，悔亡。《象》曰：涣奔其机，得愿也。"
	local div110010_4 "涣卦 六三爻辞:涣其躬，无悔。《象》曰：涣其躬，志在外也。"
	local div110010_3 "涣卦 六四爻辞:涣其群，元吉。涣有丘，匪夷所思。《象》曰：涣其群，元吉，光大也。"
	local div110010_2 "涣卦 九五爻辞:涣汗，其大号涣，王居，无咎。《象》曰：王居无咎，正位也。"
	local div110010_1 "涣卦 上九爻辞:涣其血，去逖出，无咎。《象》曰：涣其血，远害也。"
	local div010011_0 "节卦 卦辞:亨。苦节不可贞。《象》曰：泽上有水，节。君子以制数度，议德行。"
	local div010011_6 "节卦 初九爻辞:不出户庭，无咎。《象》曰：不出户庭，知通塞也。"
	local div010011_5 "节卦 九二爻辞:不出门庭，凶。《象》曰：不出门庭凶，失时极也。"
	local div010011_4 "节卦 六三爻辞:不节若，则嗟若，无咎。《象》曰：不节之嗟，又谁咎也？"
	local div010011_3 "节卦 六四爻辞:安节，亨。《象》曰：安节之亨，承上道也。"
	local div010011_2 "节卦 九五爻辞:甘节，吉，往有尚。《象》曰：甘节之吉，居位中也。"
	local div010011_1 "节卦 上六爻辞:苦节，贞凶，悔亡。《象》曰：苦节贞凶，其道穷也。"
	local div110011_0 "中孚卦 卦辞:豚鱼，吉，利涉大川，利贞。《象》曰：泽上有风，中孚。君子以议狱缓死。"
	local div110011_6 "中孚卦 初九爻辞:虞吉，有它不燕。《象》曰：初九虞吉，志未变也。"
	local div110011_5 "中孚卦 九二爻辞:鸣鹤在阴，其子和之。我有好爵，吾与尔靡之。《象》曰：其子和之，中心愿也。"
	local div110011_4 "中孚卦 六三爻辞:得敌，或鼓或罢，或泣或歌。《象》曰：可鼓或罢，位不当也。"
	local div110011_3 "中孚卦 六四爻辞:月几望，马匹亡，无咎。《象》曰：马匹亡，绝类上也。"
	local div110011_2 "中孚卦 九五爻辞:有孚挛如，无咎。《象》曰：有孚挛如，位正当也。"
	local div110011_1 "中孚卦 上九爻辞:翰音登于天，贞凶。《象》曰：翰音登于天，何可长也。"
	local div001100_0 "小过卦 卦辞:亨，利贞。可小事，不可大事。飞鸟遗之音。不宜上，宜下，大吉。《象》曰：山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。"
	local div001100_6 "小过卦 初六爻辞:飞鸟以凶。《象》曰：飞鸟以凶，不可如何也。"
	local div001100_5 "小过卦 六二爻辞:过其祖，遇其妣。不及其君，遇其臣。无咎。《象》曰：不及其君，臣不可过也。"
	local div001100_4 "小过卦 九三爻辞:弗过防之，从或戕之，凶。《象》曰：从或戕之，凶如何也。"
	local div001100_3 "小过卦 九四爻辞:无咎。弗过遇之，往厉必戒，勿用永贞。《象》曰：弗过遇之，位不当也。往厉必戒，终不可长也。"
	local div001100_2 "小过卦 六五爻辞:密云不雨，自我西郊。公弋取彼在穴。《象》曰：密云不雨，已上也。"
	local div001100_1 "小过卦 上六爻辞:弗遇过之，飞鸟离之，凶，是谓灾眚。《象》曰：弗遇过之，已亢也。"
	local div010101_0 "既济卦 卦辞:亨小，利贞。初吉终乱。《象》曰：水在火上，既济。君子以思患而预防之。"
	local div010101_6 "既济卦 初九爻辞:曳其轮，濡其尾，无咎。《象》曰：曳其轮，义无咎也。"
	local div010101_5 "既济卦 六二爻辞:妇丧其茀，勿逐，七日得。《象》曰：七日得，以中道也。"
	local div010101_4 "既济卦 九三爻辞:高宗伐鬼方，三年克之，小人勿用。《象》曰：三年克之，惫也。"
	local div010101_3 "既济卦 六四爻辞:繻有衣袽，终日戒。《象》曰：终日戒，有所疑也。"
	local div010101_2 "既济卦 九五爻辞:东邻杀牛，不如西邻之禴祭，实受其福。《象》曰：东邻杀牛，不如西邻之时也。实受其福，吉大来也。"
	local div010101_1 "既济卦 上六爻辞:濡其首，厉。《象》曰：濡其首厉，何可久也。"
	local div101010_0 "未济卦 卦辞:亨。小狐汔济，濡其尾，无攸利。《象》曰：火在水上，未济。君子以慎辨物居方。"
	local div101010_6 "未济卦 初六爻辞:濡其尾，吝。《象》曰：濡其尾，亦不知极也。"
	local div101010_5 "未济卦 九二爻辞:曳其轮，贞吉。《象》曰：九二贞吉，中以行正也。"
	local div101010_4 "未济卦 六三爻辞:未济，征凶，利涉大川。《象》曰：未济征凶，位不当也。"
	local div101010_3 "未济卦 九四爻辞:贞吉，悔亡，震用伐鬼方。三年有赏于大国。《象》曰：贞吉悔亡，志行也。"
	local div101010_2 "未济卦 六五爻辞:贞吉，无悔。君子之光，有孚，吉。《象》曰：君子之光，其晖吉也。"
	local div101010_1 "未济卦 上九爻辞:有孚于饮酒，无咎。濡其首，有孚失是。《象》曰：饮酒濡首，亦不知节也。"
	 //输入卦辞和爻辞，然后再输入六十四卦及变卦的卦名
	local sym111111 "乾"
	local sym000000 "坤"
	local sym010001 "屯"
	local sym100010 "蒙"
	local sym010111 "需"
	local sym111010 "讼"
	local sym000010 "师"
	local sym010000 "比"
	local sym110111 "小畜"
	local sym111011 "履"
	local sym000111 "泰"
	local sym111000 "否"
	local sym111101 "同人"
	local sym101111 "大有"
	local sym000100 "谦"
	local sym001000 "豫"
	local sym011001 "随"
	local sym100110 "蛊"
	local sym000011 "临"
	local sym110000 "观"
	local sym101001 "噬嗑"
	local sym100101 "贲"
	local sym100000 "剥"
	local sym000001 "复"
	local sym111001 "无妄"
	local sym100111 "大畜"
	local sym100001 "颐"
	local sym011110 "大过"
	local sym010010 "坎"
	local sym101101 "离"
	local sym011100 "咸"
	local sym001110 "恒"
	local sym111100 "遁"
	local sym001111 "大壮"
	local sym101000 "晋"
	local sym000101 "明夷"
	local sym110101 "家人"
	local sym101011 "睽"
	local sym010100 "蹇"
	local sym001010 "解"
	local sym100011 "损"
	local sym110001 "益"
	local sym011111 "夬"
	local sym111110 "姤"
	local sym011000 "萃"
	local sym000110 "升"
	local sym011010 "困"
	local sym010110 "井"
	local sym011101 "革"
	local sym101110 "鼎"
	local sym001001 "震"
	local sym100100 "艮"
	local sym110100 "渐"
	local sym001011 "归妹"
	local sym001101 "丰"
	local sym101100 "旅"
	local sym110110 "巽"
	local sym011011 "兑"
	local sym110010 "涣"
	local sym010011 "节"
	local sym110011 "中孚"
	local sym001100 "小过"
	local sym010101 "既济"
	local sym101010 "未济"
	
	 //展示卦象
	di in white "这是六爻占卜得到的卦象："
	mat l divinatory
	di in white "为`sym`div''之`sym`chgdiv''卦。"
	
	//输入完毕，开始占卜'
	if `chgsum'==0{
		local result "`div`div'_0'"
		local resweb "`sym`div''卦的卦辞"
	}
	else if `chgsum'==1{
		foreach row in 1 2 3 4 5 6{
			if el(divinatory,`row',1) != el(divinatory,`row',2){
				local result "`div`div'_`row''"
				if el(divinatory,`row',1)==1{
					local restool "九"
				}
				if el(divinatory,`row',1)==0{
					local restool "六"
				}
				if `row'==1{
					local resweb "`sym`div''卦上`restool'爻辞"
				}
				if `row'==2{
					local resweb "`sym`div''卦`restool'五爻辞"
				}
				if `row'==3{
					local resweb "`sym`div''卦`restool'四爻辞"
				}
				if `row'==4{
					local resweb "`sym`div''卦`restool'三爻辞"
				}
				if `row'==5{
					local resweb "`sym`div''卦`restool'二爻辞"
				}
				if `row'==6{
					local resweb "`sym`div''卦初`restool'爻辞"
				}
			}
		}
	}
	else if `chgsum'==2{
		foreach row in 6 5 4 3 2 1{
			if el(divinatory,`row',1) != el(divinatory,`row',2){
				local aresult "`div`div'_`row''"
				local result "`aresult'" _n "`result'"
				if el(divinatory,`row',1)==1{
					local restool "九"
				}
				if el(divinatory,`row',1)==0{
					local restool "六"
				}
				if `row'==1{
					local aresweb "`sym`div''卦上`restool'爻辞"
				}
				if `row'==2{
					local aresweb "`sym`div''卦`restool'五爻辞"
				}
				if `row'==3{
					local aresweb "`sym`div''卦`restool'四爻辞"
				}
				if `row'==4{
					local aresweb "`sym`div''卦`restool'三爻辞"
				}
				if `row'==5{
					local aresweb "`sym`div''卦`restool'二爻辞"
				}
				if `row'==6{
					local aresweb "`sym`div''卦初`restool'爻辞"
				}
				local resweb "`aresweb';`resweb'"
			}
		}
	}
	else if `chgsum'==3{
		if el(divinatory,6,1) == el(divinatory,6,2){
			local result "`div`div'_0'" _n "`div`chgdiv'_0'" _n "请进一步看对应彖辞"
			local resweb "`sym`div''卦卦辞和`sym`chgdiv''卦卦辞"
		}
		else if el(divinatory,6,1) != el(divinatory,6,2){
		    local result "`div`chgdiv'_0'" _n "`div`div'_0'" _n "请进一步看对应彖辞"
			local resweb "`sym`chgdiv''卦卦辞和`sym`div''卦卦辞"
		}
	}
	else if `chgsum'==4{
		foreach row in 1 2 3 4 5 6{
			if el(divinatory,`row',1) == el(divinatory,`row',2){
				local aresult "`div`chgdiv'_`row''"
				local result "`aresult'" _n "`result'" 
				local resweb "`aresult'和`resweb'"
				if el(divinatory,`row',1)==1{
					local restool "九"
				}
				if el(divinatory,`row',1)==0{
					local restool "六"
				}
				if `row'==1{
					local aresweb "`sym`chgdiv''卦上`restool'爻辞"
				}
				if `row'==2{
					local aresweb "`sym`chgdiv''卦`restool'五爻辞"
				}
				if `row'==3{
					local aresweb "`sym`chgdiv''卦`restool'四爻辞"
				}
				if `row'==4{
					local aresweb "`sym`chgdiv''卦`restool'三爻辞"
				}
				if `row'==5{
					local aresweb "`sym`chgdiv''卦`restool'二爻辞"
				}
				if `row'==6{
					local aresweb "`sym`chgdiv''卦初`restool'爻辞"
				}
				local resweb "`aresweb';`resweb'"
			}
		}
	}
	else if `chgsum'==5{
		foreach row in 1 2 3 4 5 6{
			if el(divinatory,`row',1) == el(divinatory,`row',2){
				local result "`div`chgdiv'_`row''"
				local resweb "`div`chgdiv'_`row''"
				if el(divinatory,`row',1)==1{
					local restool "九"
				}
				if el(divinatory,`row',1)==0{
					local restool "六"
				}
				if `row'==1{
					local resweb "`sym`chgdiv''卦上`restool'爻辞"
				}
				if `row'==2{
					local resweb "`sym`chgdiv''卦`restool'五爻辞"
				}
				if `row'==3{
					local resweb "`sym`chgdiv''卦`restool'四爻辞"
				}
				if `row'==4{
					local resweb "`sym`chgdiv''卦`restool'三爻辞"
				}
				if `row'==5{
					local resweb "`sym`chgdiv''卦`restool'二爻辞"
				}
				if `row'==6{
					local resweb "`sym`chgdiv''卦初`restool'爻辞"
				}
			}
		}
	}
	else if `chgsum'==6{
		local result "`div`chgdiv'_0'"
		if "`div'"=="111111"{
		local result "用九：见群龙无首，吉。《象》曰：用九，天德不可为首也。"
		local resweb "乾卦用九爻辞"
		}
		else if "`div'"=="000000"{
		local result "用六：利，永贞。《象》曰：用六永贞，以大终也。"
		local resweb "困卦用六爻辞"
		}
	}
	di in white _n "这是《易》中的卦/爻辞与注释，两条辞则以前者为主：" _n "`result'"
	if `quif' ==1{
	    di `"{browse "https://metaso.cn/?q=我想问`question',占卜得到的结果是`resweb'请你分析": AI搜索网页 }"'
	}
	else {
		di `"{browse "https://metaso.cn/?q=我占卜的结果是`resweb'请你分析": AI搜索网页 }"'
	}
	ma drop _all
end